
layer {
  name: "data"
  type: "Data"
  top: "label"
  include {
    phase: TRAIN
  }
  transform_param {
    #mirror: true
    crop_size: 227
 } 
# mean pixel / channel-wise mean instead of mean image
#  transform_param {
#    crop_size: 224
#    mean_value: 104
#    mean_value: 117
#    mean_value: 123
#    mirror: true
#  }
  data_param {
    source: "/media/camalab/DATADRIVE1/LMDB/32691/2.2w"
    batch_size: 1
    backend: LMDB
  }
}

layer {
  name: "data"
  type: "Data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    #mirror: true
    crop_size: 227
 } 
# mean pixel / channel-wise mean instead of mean image
#  transform_param {
#    crop_size: 224
#    mean_value: 104
#    mean_value: 117
#    mean_value: 123
#    mirror: true
#  }
  data_param {
    source: "/media/camalab/DATADRIVE1/LMDB/32691/2.2w"
    batch_size: 1
    backend: LMDB
  }
}

